Revit 2024 API
BRepBuilderPersistentIds Constructor
 Constructs a new BRepBuilderPersistentIds and associates the existing BRepBuilder to it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public BRepBuilderPersistentIds(
	BRepBuilder bRepBuilder
)
Visual Basic
Public Sub New ( _
	bRepBuilder As BRepBuilder _
)
Visual C++
public:
BRepBuilderPersistentIds(
	BRepBuilder^ bRepBuilder
)
Parameters
bRepBuilder
Type: Autodesk.Revit.DB.BRepBuilder
 The existing BRepBuilder.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
BRepBuilderPersistentIds Class
Autodesk.Revit.DB Namespace